config/DataProcessors/ОбработкаЛистаПроверкиООК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаЛистаПроверкиООК</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыбДокПроверки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РезультатыПроверкиМагазинаОперДеп</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабДок</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Управляющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

config/Documents/РезультатыПроверкиМагазинаОперДеп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>РезультатыПроверкиМагазинаОперДеп</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Управляющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НацДиректор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионДиректор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолвоБаллов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСоответствия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Результаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Критерий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КритерииПроверкиМагазиновООК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоСлужба</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарииПроверяющего</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокУстранения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗадачаУправляющему</Name>
							<Type>
								<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийИсполнителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтметкаОбИсполнении</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыВыполнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/Catalogs/Подразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Подразделения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПодразделенияУТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Управляющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/Catalogs/КритерииПроверкиМагазиновООК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>КритерииПроверкиМагазиновООК</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолнНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакОтветственныеДепартаменты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/DataProcessors/ОбработкаЛистаПроверкиООК/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем МеняемоеЗначение;

&НаКлиенте
Перем МеняемоеЗначениеСлужба;

&НаКлиенте
Перем Закрывать;

&НаСервере
Процедура ПроверкаПравРедактирования()
	 ТабДок = РеквизитФормыВЗначение("Объект").ТабДок;
	 ВыбДокумент = РеквизитФормыВЗначение("Объект").ВыбДокПроверки;
	 РедактированиеДокумента = Ложь;
	 Если ТекущаяДата()-ВыбДокумент.Дата < Константы.КолвоЧасовРедактированияДокументаЛистСокращенный.Получить()*3600 Тогда
		 РедактированиеДокумента = Истина;
	 КонецЕсли;
	 Если (НЕ РедактированиеДокумента) И (ВыбДокумент.Автор = ПользователиКлиентСервер.ТекущийПользователь()) Тогда
		 ТабДок.Область("R1C1:R"+ Строка(ТабДок.ВысотаТаблицы) + "C6").Защита = Истина;
	 КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НачальноеЗаполнениеТабДок()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбъект.ДатаПроверки = ТекущаяДата();
	ОбработкаОбъект.Город = Справочники.Города.ПустаяСсылка();
	ОбработкаОбъект.Подразделение = Справочники.Подразделения.ПустаяСсылка();
	ОбработкаОбъект.Управляющий = Справочники.Сотрудники.ПустаяСсылка();
	ОбработкаОбъект.РД = Справочники.Сотрудники.ПустаяСсылка();
	ОбработкаОбъект.НД = Справочники.Сотрудники.ПустаяСсылка();
	ТабДок = ОбработкаОбъект.ТабДок;
	ТабДок.Очистить();
	
	Макет1 = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет1");
	
	Обл = Макет1.ПолучитьОбласть("Шапка");
	
	ТабДок.Вывести(Обл);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КритерииПроверкиМагазиновООК.Ссылка КАК Ссылка,
	               |	КритерииПроверкиМагазиновООК.Родитель КАК Родитель,
	               |	КритерииПроверкиМагазиновООК.ЭтоГруппа КАК ЭтоГруппа,
	               |	КритерииПроверкиМагазиновООК.ПолнНаименование КАК ПолнНаименование,
	               |	ВЫБОР
	               |		КОГДА НЕ КритерииПроверкиМагазиновООК.ЭтоГруппа
	               |			ТОГДА КритерииПроверкиМагазиновООК.НомерПоПорядку
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА КритерииПроверкиМагазиновООК.Родитель.Ссылка ЕСТЬ NULL 
	               |					ТОГДА 1000 * КритерииПроверкиМагазиновООК.НомерПоПорядку
	               |				ИНАЧЕ 1000 * КритерииПроверкиМагазиновООК.Родитель.НомерПоПорядку + КритерииПроверкиМагазиновООК.НомерПоПорядку
	               |			КОНЕЦ
	               |	КОНЕЦ КАК НомерПоПорядку,
	               |	ВЫБОР
	               |		КОГДА КритерииПроверкиМагазиновООК.Родитель.Ссылка ЕСТЬ NULL 
	               |			ТОГДА 0
	               |		ИНАЧЕ КритерииПроверкиМагазиновООК.Родитель.НомерПоПорядку
	               |	КОНЕЦ КАК РодительНомерПоПорядку,
	               |	КритерииПроверкиМагазиновООК.Описание
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Справочник.КритерииПроверкиМагазиновООК КАК КритерииПроверкиМагазиновООК
	               |ГДЕ
	               |	НЕ КритерииПроверкиМагазиновООК.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Родитель,
	               |	СУММА(1) КАК КолЭлементов
	               |ПОМЕСТИТЬ ВТ_колЭлементов
	               |ИЗ
	               |	ВТ КАК ВТ
	               |ГДЕ
	               |	ВТ.ЭтоГруппа = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.Родитель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Родитель,
	               |	СУММА(ВТ_колЭлементов.КолЭлементов) КАК КолЭлементов
	               |ПОМЕСТИТЬ ВТ_колЭлементовРодитель1
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_колЭлементов КАК ВТ_колЭлементов
	               |		ПО ВТ.Ссылка = ВТ_колЭлементов.Родитель
	               |ГДЕ
	               |	ВТ.ЭтоГруппа = ИСТИНА
	               |	И ВТ.Родитель <> ЗНАЧЕНИЕ(Справочник.КритерииПроверкиМагазиновООК.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.Родитель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Ссылка,
	               |	ВТ.Родитель,
	               |	ВТ.ЭтоГруппа,
	               |	ВТ.ПолнНаименование,
	               |	ВЫБОР
	               |		КОГДА ВТ.НомерПоПорядку > 1000
	               |			ТОГДА ВТ.НомерПоПорядку
	               |		ИНАЧЕ ВТ.РодительНомерПоПорядку * 1000 + ВТ.НомерПоПорядку
	               |	КОНЕЦ КАК ОбщийНомерПоПорядку,
	               |	ВТ.НомерПоПорядку,
	               |	ВТ.РодительНомерПоПорядку,
	               |	ЕСТЬNULL(ВТ_колЭлементов.КолЭлементов, 0) + ЕСТЬNULL(ВТ_колЭлементовРодитель1.КолЭлементов, 0) КАК КолЭлементов,
	               |	ВТ.Описание,
	               |	ВТ.Ссылка.ПризнакОтветственныеДепартаменты КАК ПризнакОтветственныеДепартаменты
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_колЭлементов КАК ВТ_колЭлементов
	               |		ПО ВТ.Ссылка = ВТ_колЭлементов.Родитель
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_колЭлементовРодитель1 КАК ВТ_колЭлементовРодитель1
	               |		ПО ВТ.Ссылка = ВТ_колЭлементовРодитель1.Родитель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОбщийНомерПоПорядку";
				   
	тз = Запрос.Выполнить().Выгрузить();
	
	КолвоКритериевМаг = 0;
	КолвоКритериевОтвДеп = 0;
	
	Нпп = 0;
	Для Каждого стр из тз цикл
		Если стр.ЭтоГруппа тогда
			//Если ЗначениеЗаполнено(стр.Родитель) тогда  // подгруппа
			Обл = Макет1.ПолучитьОбласть("Группа");
			Обл.Параметры.СтрГруппа = стр.ПолнНаименование;
			Обл.Параметры.Родитель = стр.Родитель;
			Обл.Параметры.БалГруппа = стр.КолЭлементов;
			Обл.Параметры.БалГруппаСлужба = стр.КолЭлементов;
			Обл.Параметры.ТекКритерий = стр.Ссылка;

			ТабДок.Вывести(Обл);

			//иначе  // раздел
			//	Обл = Макет1.ПолучитьОбласть("Раздел");
			//	Обл.Параметры.СтрРаздел = стр.ПолнНаименование;
			//	Обл.Параметры.Родитель = "Сам";
			//	Обл.Параметры.БалРаздел = стр.КолЭлементов;
			//	ТабДок.Вывести(Обл);

			//КонецЕсли;
			
		иначе // строка
			
			Нпп = Нпп + 1;

			Обл = Макет1.ПолучитьОбласть("Строка");
			Обл.Параметры.Нпп = Нпп;
			Обл.Параметры.СтрБал = 1;
			Обл.Параметры.СтрБалСлужба = 1;
			Обл.Параметры.СтрНаим = стр.ПолнНаименование;
			//Обл.Параметры.СтрОписание = стр.Описание;
			Обл.Параметры.Родитель = стр.Родитель;
		    Обл.Параметры.ТекКритерий = стр.Ссылка;
			ТабДок.Вывести(Обл);
			
			//Если стр.ПризнакОтветственныеДепартаменты тогда
			//	КолвоКритериевОтвДеп = КолвоКритериевОтвДеп + 1;
			//иначе
				КолвоКритериевМаг = КолвоКритериевМаг + 1;
			//КонецЕсли;
		КонецЕсли;

	КонецЦикла;
	ОблПусто = Макет1.ПолучитьОбласть("Пусто");
	ТабДок.Вывести(ОблПусто);
	//КолвоКритериевМаг = Нпп;
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
	ТабДок.ФиксацияСверху = 12;
	
	//Объект.ТабДок.Область("R7C4").Значение = КолвоКритериевОтвДеп + КолвоКритериевМаг;
	//Объект.ТабДок.Область("R7C5").Значение = "100 %";
	
	Объект.ТабДок.Область("R8C3").Значение = КолвоКритериевМаг;
	Объект.ТабДок.Область("R9C3").Значение = "100 %";

	//Объект.ТабДок.Область("R9C4").Значение = КолвоКритериевОтвДеп;
	//Объект.ТабДок.Область("R9C5").Значение = "100 %";

КонецПроцедуры

&НаСервере
Процедура ПроверитьХранилище()
	Если ХранилищеНастроекДанныхФорм.Загрузить("ООК","ТЗзаполнения") <> Неопределено 
		ИЛИ ХранилищеНастроекДанныхФорм.Загрузить("ООК","Город") <> Неопределено
		ИЛИ ХранилищеНастроекДанныхФорм.Загрузить("ООК","Управляющий") <> Неопределено
		ИЛИ ХранилищеНастроекДанныхФорм.Загрузить("ООК","Подразделение") <> Неопределено
		ИЛИ ХранилищеНастроекДанныхФорм.Загрузить("ООК","РД") <> Неопределено
		ИЛИ ХранилищеНастроекДанныхФорм.Загрузить("ООК","НД") <> Неопределено ТОГДА
			ЕстьДанныеВХранилище = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоместитьВХранилище(НомСтроки)
	Если НЕ ЗначениеЗаполнено(Объект.ВыбДокПроверки) Тогда
		ТЗ = ХранилищеНастроекДанныхФорм.Загрузить("ООК","ТЗзаполнения");
		Если ТипЗнч(ТЗ) <> Тип("ТаблицаЗначений") Тогда
			ТЗ = Новый ТаблицаЗначений;
			ТЗ.Колонки.Добавить("НомерСтроки",Новый ОписаниеТипов("Число"));
			ТЗ.Колонки.Добавить("Бал",Новый ОписаниеТипов("Число"));
			ТЗ.Колонки.Добавить("Комментарий",Новый ОписаниеТипов("Строка"));
			ТЗ.Колонки.Добавить("Срок",Новый ОписаниеТипов("Дата"));
		КонецЕсли;
		СтрокаТаблицы = ТЗ.Найти(НомСтроки,"НомерСтроки");
		Если СтрокаТаблицы = Неопределено Тогда
			СтрокаТаблицы = ТЗ.Добавить();
			СтрокаТаблицы.НомерСтроки = НомСтроки;
		КонецЕсли;
		СтрокаТаблицы.Бал = Число(Булево(Объект.ТабДок.Область("R"+НомСтроки+"C3").Значение));
		СтрокаТаблицы.Комментарий=Объект.ТабДок.Область("R"+НомСтроки+"C5").Значение;
		СтрокаТаблицы.Срок = Объект.ТабДок.Область("R"+НомСтроки+"C6").Значение;
		ТЗ.Сортировать("НомерСтроки");
		ХранилищеНастроекДанныхФорм.Сохранить("ООК","ТЗзаполнения",ТЗ);
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура ОчиститьХранилище()
	ХранилищеНастроекДанныхФорм.Удалить("ООК","ТЗзаполнения",ПользователиКлиентСервер.ТекущийПользователь());
	ХранилищеНастроекДанныхФорм.Удалить("ООК","Город",ПользователиКлиентСервер.ТекущийПользователь());
	ХранилищеНастроекДанныхФорм.Удалить("ООК","Управляющий",ПользователиКлиентСервер.ТекущийПользователь());
	ХранилищеНастроекДанныхФорм.Удалить("ООК","Подразделение",ПользователиКлиентСервер.ТекущийПользователь());
	ХранилищеНастроекДанныхФорм.Удалить("ООК","РД",ПользователиКлиентСервер.ТекущийПользователь());
	ХранилищеНастроекДанныхФорм.Удалить("ООК","НД",ПользователиКлиентСервер.ТекущийПользователь());
КонецПроцедуры

&НаСервере
Процедура ВосстановитьИзХранилища()
	ПолеГород = ХранилищеНастроекДанныхФорм.Загрузить("ООК","Город");
	Если ПолеГород <> Неопределено Тогда
		Объект.Город = ПолеГород;
	КонецЕсли;
	
	ПолеУправляющий = ХранилищеНастроекДанныхФорм.Загрузить("ООК","Управляющий");
	Если ПолеУправляющий <> Неопределено Тогда
		Объект.Управляющий = ПолеУправляющий;
	КонецЕсли;
	
	ПолеПодразделение = ХранилищеНастроекДанныхФорм.Загрузить("ООК","Подразделение");
	Если ПолеПодразделение <> Неопределено Тогда
		Объект.Подразделение = ПолеПодразделение;
	КонецЕсли;
	
	ПолеРД = ХранилищеНастроекДанныхФорм.Загрузить("ООК","РД");
	Если ПолеРД <> Неопределено Тогда
		Объект.РД = ПолеРД;
	КонецЕсли;
	
	ПолеНД = ХранилищеНастроекДанныхФорм.Загрузить("ООК","НД");
	Если ПолеНД <> Неопределено Тогда
		Объект.НД = ПолеНД;
	КонецЕсли;
	
	ТЗзаполнения = ХранилищеНастроекДанныхФорм.Загрузить("ООК","ТЗзаполнения");
	Если ТЗзаполнения <> Неопределено Тогда
		Для Каждого СтрокаТаблицы из ТЗзаполнения Цикл
			Объект.ТабДок.Область("R"+СтрокаТаблицы.НомерСтроки + "C3").Значение = СтрокаТаблицы.Бал;
			Объект.ТабДок.Область("R"+СтрокаТаблицы.НомерСтроки + "C3").Формат = "ЧН=0"; 
			Объект.ТабДок.Область("R"+СтрокаТаблицы.НомерСтроки + "C5").Значение = СтрокаТаблицы.Комментарий;
			Объект.ТабДок.Область("R"+СтрокаТаблицы.НомерСтроки + "C6").Значение = СтрокаТаблицы.Срок;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьПризнакОтвДепартамента(ЭлемСправочника)
	ПризнакОтвДепертаменты = Ложь;
	//Если не ЭлемСправочника.ЭтоГруппа тогда 
	//	Попытка
	//		ПризнакОтвДепертаменты = ЭлемСправочника.ПризнакОтветственныеДепартаменты;
	//	Исключение
	//		ПризнакОтвДепертаменты = Ложь;
	//	КонецПопытки;
	//КонецЕсли;
	Возврат ПризнакОтвДепертаменты;
КонецФункции


&НаКлиенте
Процедура ПересчетСуммРазделов()
	ОбщСуммаМаг = 0;
	ОбщСуммаОтвДеп = 0;
	
	Для НомСтр = 13 по Объект.ТабДок.ВысотаТаблицы - 1 цикл
		//Предварительное обнуление разделов и групп
		Если Объект.ТабДок.Область("R" + Строка(НомСтр) + "C1").Текст = "" Тогда
			 Объект.ТабДок.Область("R" + Строка(НомСтр) + "C3").Значение = 0;
		КонецЕсли;
		ТекКритерийРодитель = Объект.ТабДок.Область("R" + Строка(НомСтр) + "C1").Расшифровка;
		Родитель = Объект.ТабДок.НайтиТекст(Строка(ТекКритерийРодитель),,,,Истина);
		Если Родитель <>Неопределено Тогда
			Объект.ТабДок.Область("R" + Родитель.Верх + "C3").Значение = Число(Объект.ТабДок.Область("R" + Родитель.Верх + "C3").Значение) +  
				Число(Объект.ТабДок.Область("R" + Строка(НомСтр) + "C3").Значение);
				
			//ОбщСумма = ОбщСумма +  Число(Объект.ТабДок.Область("R" + Строка(НомСтр) + "C4").Значение);
			ТекКритерий =  Объект.ТабДок.Область("R" + НомСтр + "C2").Расшифровка;
			
			//Если ЗначениеЗаполнено(ТекКритерий) тогда
			//	ПризнакОтвДепертаменты = ПолучитьПризнакОтвДепартамента(ТекКритерий); 
			//иначе
				ПризнакОтвДепертаменты = Ложь;
			//КонецЕсли;


			
			//Если не ПризнакОтвДепертаменты тогда
				ОбщСуммаМаг = ОбщСуммаМаг +  Число(Объект.ТабДок.Область("R" + Строка(НомСтр) + "C3").Значение);
			//иначе
			//	ОбщСуммаОтвДеп = ОбщСуммаОтвДеп +  Число(Объект.ТабДок.Область("R" + Строка(НомСтр) + "C3").Значение);
			//КонецЕсли;

			РодительРодитель = Объект.ТабДок.НайтиТекст(Строка(ТекКритерий),,,,Истина);
			
			//Если РодительРодитель <> Неопределено И РодительРодитель.Текст <> "Сам" Тогда 
			//	Объект.ТабДок.Область("R" + РодительРодитель.Верх + "C3").Значение = Число(Объект.ТабДок.Область("R" + РодительРодитель.Верх + "C3").Значение) +  
			//		Число(Объект.ТабДок.Область("R" + Строка(НомСтр) + "C3").Значение);	
			//КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Объект.ТабДок.Область("R8C3").Значение	= ОбщСуммаМаг + ОбщСуммаОтвДеп;
	Если (КолвоКритериевМаг + КолвоКритериевОтвДеп) <> 0 Тогда
		Объект.ТабДок.Область("R9C3").Значение	= Строка(Формат(((ОбщСуммаМаг + ОбщСуммаОтвДеп)/(КолвоКритериевМаг + КолвоКритериевОтвДеп))*100,"ЧДЦ=2; ЧН=0,00"))+" %";
	Иначе 
		Объект.ТабДок.Область("R9C3").Значение	= Строка(Формат(0,"ЧДЦ=2; ЧН=0,00"))+" %";
	КонецЕсли;
	
	//Объект.ТабДок.Область("R8C4").Значение	= ОбщСуммаМаг;
	//Если КолвоКритериевМаг <> 0 Тогда
	//	Объект.ТабДок.Область("R8C5").Значение	= Строка(Формат((ОбщСуммаМаг/КолвоКритериевМаг)*100,"ЧДЦ=2; ЧН=0,00"))+" %";
	//Иначе 
	//	Объект.ТабДок.Область("R8C5").Значение	= Строка(Формат(0,"ЧДЦ=2; ЧН=0,00"))+" %";
	//КонецЕсли;

	//Объект.ТабДок.Область("R9C4").Значение	= ОбщСуммаОтвДеп;
	//Если КолвоКритериевОтвДеп <> 0 Тогда
	//	Объект.ТабДок.Область("R9C5").Значение	= Строка(Формат((ОбщСуммаОтвДеп/КолвоКритериевОтвДеп)*100,"ЧДЦ=2; ЧН=0,00"))+" %";
	//Иначе 
	//	Объект.ТабДок.Область("R9C5").Значение	= Строка(Формат(0,"ЧДЦ=2; ЧН=0,00"))+" %";
	//КонецЕсли;
	
	// Баллы по службам
	Для НомСтр = 13 по Объект.ТабДок.ВысотаТаблицы - 1 цикл
		//Предварительное обнуление разделов и групп
		Если Объект.ТабДок.Область("R" + Строка(НомСтр) + "C1").Текст = "" Тогда
			 Объект.ТабДок.Область("R" + Строка(НомСтр) + "C4").Значение = 0;
		КонецЕсли;
		ТекКритерийРодитель = Объект.ТабДок.Область("R" + Строка(НомСтр) + "C1").Расшифровка;
		Родитель = Объект.ТабДок.НайтиТекст(Строка(ТекКритерийРодитель),,,,Истина);
		Если Родитель <>Неопределено Тогда
			Объект.ТабДок.Область("R" + Родитель.Верх + "C4").Значение = Число(Объект.ТабДок.Область("R" + Родитель.Верх + "C4").Значение) +  
				Число(Объект.ТабДок.Область("R" + Строка(НомСтр) + "C4").Значение);
				
			ТекКритерий =  Объект.ТабДок.Область("R" + НомСтр + "C2").Расшифровка;
			
			ОбщСуммаМаг = ОбщСуммаМаг +  Число(Объект.ТабДок.Область("R" + Строка(НомСтр) + "C4").Значение);
		
			РодительРодитель = Объект.ТабДок.НайтиТекст(Строка(ТекКритерий),,,,Истина);
		КонецЕсли;
	КонецЦикла;


КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммРазделовДляЯчейки(НомСтр,Было,Стало)
	ТекКритерийРодитель = Объект.ТабДок.Область("R" + Строка(НомСтр) + "C1").Расшифровка;	
	Для НомС = 13 по Объект.ТабДок.ВысотаТаблицы - 1 цикл
		Если Объект.ТабДок.Область("R" + Строка(НомС) + "C2").Текст = Строка(ТекКритерийРодитель) Тогда
			РодительСтр = НомС;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	Объект.ТабДок.Область("R" + РодительСтр + "C3").Значение = Число(Объект.ТабДок.Область("R" + РодительСтр + "C3").Значение) - Число(Было) + Число(Стало);
	
	ТекКритерий =  Объект.ТабДок.Область("R" + НомСтр + "C2").Расшифровка;
	Если ЗначениеЗаполнено(ТекКритерий) тогда
		Если ЗначениеЗаполнено(ТекКритерий) тогда
			ПризнакОтвДепертаменты = ПолучитьПризнакОтвДепартамента(ТекКритерий); 
		иначе
			ПризнакОтвДепертаменты = Ложь;
		КонецЕсли;
	иначе
		ПризнакОтвДепертаменты = Ложь;
	КонецЕсли;

	
	//РодительРодительСтр = Объект.ТабДок.НайтиТекст(Строка(ТекКритерий),,,,Истина).Верх;
	//Объект.ТабДок.Область("R" + РодительРодительСтр + "C4").Значение = Число(Объект.ТабДок.Область("R" + РодительРодительСтр + "C4").Значение) - Число(Было) + Число(Стало);
	//общий балл
	Объект.ТабДок.Область("R8C3").Значение	= Число(Объект.ТабДок.Область("R8C3").Значение)- Число(Было) + Число(Стало);
	Объект.ТабДок.Область("R9C3").Значение	= Строка(Формат((Объект.ТабДок.Область("R8C3").Значение/(КолвоКритериевМаг + КолвоКритериевОтвДеп))*100,"ЧДЦ=2; ЧН=0,00"))+" %";
	//Если не ПризнакОтвДепертаменты тогда
	//	// балл магазина
	//	Объект.ТабДок.Область("R8C4").Значение	= Число(Объект.ТабДок.Область("R8C4").Значение)- Число(Было) + Число(Стало);
	//	Объект.ТабДок.Область("R8C5").Значение	= Строка(Формат((Объект.ТабДок.Область("R8C4").Значение/КолвоКритериевМаг)*100,"ЧДЦ=2; ЧН=0,00"))+" %";
	//иначе
	//	// балл отв.департаментов
	//	Объект.ТабДок.Область("R9C4").Значение	= Число(Объект.ТабДок.Область("R9C4").Значение)- Число(Было) + Число(Стало);
	//	Объект.ТабДок.Область("R9C5").Значение	= Строка(Формат((Объект.ТабДок.Область("R9C4").Значение/КолвоКритериевОтвДеп)*100,"ЧДЦ=2; ЧН=0,00"))+" %";
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммРазделовДляЯчейкиСлужба(НомСтр,Было,Стало)
	ТекКритерийРодитель = Объект.ТабДок.Область("R" + Строка(НомСтр) + "C1").Расшифровка;	
	Для НомС = 13 по Объект.ТабДок.ВысотаТаблицы - 1 цикл
		Если Объект.ТабДок.Область("R" + Строка(НомС) + "C2").Текст = Строка(ТекКритерийРодитель) Тогда
			РодительСтр = НомС;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	Объект.ТабДок.Область("R" + РодительСтр + "C4").Значение = Число(Объект.ТабДок.Область("R" + РодительСтр + "C4").Значение) - Число(Было) + Число(Стало);
	
	////общий балл
	//Объект.ТабДок.Область("R8C3").Значение	= Число(Объект.ТабДок.Область("R8C3").Значение)- Число(Было) + Число(Стало);
	//Объект.ТабДок.Область("R9C3").Значение	= Строка(Формат((Объект.ТабДок.Область("R8C3").Значение/(КолвоКритериевМаг + КолвоКритериевОтвДеп))*100,"ЧДЦ=2; ЧН=0,00"))+" %";
	
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НачальноеЗаполнениеТабДок();
	Табл = РеквизитФормыВЗначение("Объект");
	Табл.ТабДок.НаправлениеПерехода = ТипНаправленияПереходаТабличногоДокумента.ПоСтрокам;
	ЗначениеВРеквизитФормы(Табл,"Объект");
	ПоказатьШапку = Истина;
	ПроверитьХранилище();
КонецПроцедуры

&НаСервере
Функция СохранитьВДокументНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТабДок = ОбработкаОбъект.ТабДок;
	ВыбДокумент = ОбработкаОбъект.ВыбДокПроверки;
	
	Если не ЗначениеЗаполнено(ВыбДокумент) тогда
		//создаем
		ТекДокПроверки = Документы.РезультатыПроверкиМагазинаОперДеп.СоздатьДокумент();
		
	иначе
		ТекДокПроверки = ВыбДокумент.ПолучитьОбъект();
		ТекДокПроверки.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ТекДокПроверки.Результаты.Очистить();
	КонецЕсли;
	
	ТекДокПроверки.Автор = ПараметрыСеанса.ТекущийПользователь;
	
	ТекДокПроверки.Город = ОбработкаОбъект.Город;
	ТекДокПроверки.Подразделение = ОбработкаОбъект.Подразделение;
	ТекДокПроверки.Дата = ОбработкаОбъект.ДатаПроверки;
	Если ТекДокПроверки.Дата =НачалоДня(ТекущаяДата()) Тогда
		ТекДокПроверки.Дата = ТекущаяДата();
	КонецЕсли;
	ТекДокПроверки.Управляющий = ОбработкаОбъект.Управляющий;	
	ТекДокПроверки.РегионДиректор = ОбработкаОбъект.РД;
	ТекДокПроверки.НацДиректор = ОбработкаОбъект.НД;
	ТекДокПроверки.КолвоБаллов = ТабДок.Область("R8C3").Значение;
	ТекДокПроверки.ПроцентСоответствия = Лев(ТабДок.Область("R9C3").Значение,Найти(ТабДок.Область("R9C3").Значение,"%")-2);
	
	ТекДокПроверки.Записать(РежимЗаписиДокумента.Запись); //***
	
	Для НомСтр = 13 по ТабДок.ВысотаТаблицы цикл
		СсылкаНаЭлСпр = ТабДок.Область("R" + Строка(НомСтр) + "C2").Расшифровка;
		
		Если ЗначениеЗаполнено(СсылкаНаЭлСпр) тогда
			Если СсылкаНаЭлСпр.ЭтоГруппа тогда
				ПРодолжить;
			КонецЕсли;
			
			нов = ТекДокПроверки.Результаты.Добавить();
			нов.Критерий = СсылкаНаЭлСпр;
			//нов.Описание = нов.Критерий.Описание;
			
			Попытка
				нов.Кво = Число(ТабДок.Область("R" + Строка(НомСтр) + "C3").Текст);
			Исключение
				нов.Кво = 1;
			КонецПопытки;
			
			Попытка
				нов.КвоСлужба = Число(ТабДок.Область("R" + Строка(НомСтр) + "C4").Текст);
			Исключение
				нов.КвоСлужба = 1;
			КонецПопытки;

						
			нов.КомментарииПроверяющего = ТабДок.Область("R" + Строка(НомСтр) + "C5").Текст;
			нов.СрокУстранения = ТабДок.Область("R" + Строка(НомСтр) + "C6").Значение;
		
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		ТекДокПроверки.Записать(РежимЗаписиДокумента.Проведение);
		ОчиститьХранилище();
	Исключение
		Сообщить("Документ не проведен по причине " + ОписаниеОшибки());
	КонецПопытки;
	Возврат ТекДокПроверки.Ссылка;  
	
КонецФункции

&НаКлиенте
Процедура СохранитьВДокумент(Команда)	
	СохранитьНаКлиенте();	
КонецПроцедуры

&НаКлиенте
Функция СохранитьНаКлиенте()
	Таб = Объект.ТабДок;
	Если  Строка(Объект.Город)  = "" Тогда
		 ПоказатьОповещениеПользователя("Документ не сохранен",, "Не заполнено поле ""Город""",БиблиотекаКартинок.Информация32);
		 Возврат Ложь;
	КонецЕсли;
	Если  Строка(Объект.Подразделение)  = "" Тогда
		 ПоказатьОповещениеПользователя("Документ не сохранен",, "Не заполнено поле ""ProStor №""",БиблиотекаКартинок.Информация32);
		 Возврат Ложь;
	КонецЕсли; 
	Если  Строка(Объект.Управляющий)  = "" Тогда
		 ПоказатьОповещениеПользователя("Документ не сохранен",, "Не заполнено поле ""Управляющий""",БиблиотекаКартинок.Информация32);
		 Возврат Ложь;
	КонецЕсли;
	 
	Если  Строка(Объект.РД)  = "" Тогда
		 ПоказатьОповещениеПользователя("Документ не сохранен",, "Не заполнено поле ""Региональный директор""",БиблиотекаКартинок.Информация32);
		 Возврат Ложь;
	КонецЕсли;
	 
	Если  Строка(Объект.НД)  = "" Тогда
		 ПоказатьОповещениеПользователя("Документ не сохранен",, "Не заполнено поле ""Национальный директор""",БиблиотекаКартинок.Информация32);
		 Возврат Ложь;
	КонецЕсли;
	 
	Для НомСтр = 13 по Таб.ВысотаТаблицы - 1 цикл
		СсылкаНаЭлСпр = Таб.Область("R" + Строка(НомСтр) + "C2").Расшифровка;
		Если ЗначениеЗаполнено(СсылкаНаЭлСпр) тогда
			Если Таб.Область("R" + Строка(НомСтр) + "C3").Значение <> 1 Тогда
				ТекстСообщения="";
				НомерСтрокиВТаблице = Таб.Область("R" + Строка(НомСтр) + "C1").Значение; 
				Если НомерСтрокиВТаблице > 0 тогда
					Если Таб.Область("R" + Строка(НомСтр) + "C6").Значение = Дата(1,1,1) Тогда
						ТекстСообщения="В строке "+ Таб.Область("R" + Строка(НомСтр) + "C1").Значение + " не указана дата устранения."+Символы.ПС+ "Документ не сохранен";
					КонецЕсли;
					
					Если Таб.Область("R" + Строка(НомСтр) + "C5").Значение = "" Тогда
						ТекстСообщения="В строке "+ Таб.Область("R" + Строка(НомСтр) + "C1").Значение + " не указана задача по устранению."+Символы.ПС+ "Документ не сохранен";
					КонецЕсли;
				КонецЕсли;
				
				Если ТекстСообщения<>"" Тогда
					Сообщить(ТекстСообщения);
					Возврат Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
    Док = СохранитьВДокументНаСервере();
	Объект.ВыбДокПроверки = Док;
	Возврат Истина;
КонецФункции

&НаСервере
Процедура ВыбДокПроверкиПриИзмененииНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТабДок = ОбработкаОбъект.ТабДок;
	
	ТабДок.Очистить();
	
	ВыбДокумент = ОбработкаОбъект.ВыбДокПроверки;
	
	Если не ЗначениеЗаполнено(ВыбДокумент) тогда
		НачальноеЗаполнениеТабДок();
		Возврат;
	КонецЕсли;
		
	ОбработкаОбъект.ДатаПроверки = ВыбДокумент.Дата;
	ОбработкаОбъект.Подразделение = ВыбДокумент.Подразделение;	      		
	ОбработкаОбъект.Город = ВыбДокумент.Город;			
	ОбработкаОбъект.Управляющий = ВыбДокумент.Управляющий;			
	ОбработкаОбъект.РД = ВыбДокумент.РегионДиректор;			
	ОбработкаОбъект.НД = ВыбДокумент.НацДиректор;	
	
	Макет1 = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет1");
	
	Обл = Макет1.ПолучитьОбласть("Шапка");

	ТабДок.Вывести(Обл);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Ссылка,
	               |	ВложенныйЗапрос.Родитель,
	               |	ВложенныйЗапрос.ЭтоГруппа,
	               |	ВложенныйЗапрос.ПолнНаименование,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.НомерПоПорядку > 1000
	               |			ТОГДА ВложенныйЗапрос.НомерПоПорядку
	               |		ИНАЧЕ ВложенныйЗапрос.РодительНомерПоПорядку * 1000 + ВложенныйЗапрос.НомерПоПорядку
	               |	КОНЕЦ КАК ОбщийНомерПоПорядку,
	               |	ВложенныйЗапрос.НомерПоПорядку,
	               |	ВложенныйЗапрос.РодительНомерПоПорядку,
	               |	СУММА(ВложенныйЗапрос.Кво) КАК Кво,
	               |	МАКСИМУМ(ВложенныйЗапрос.КомментарииПроверяющего) КАК КомментарииПроверяющего,
	               |	МАКСИМУМ(ВложенныйЗапрос.СрокУстранения) КАК СрокУстранения,
	               |	МАКСИМУМ(ВложенныйЗапрос.ОтметкаОбИсполнении) КАК ОтметкаОбИсполнении,
	               |	МАКСИМУМ(ВложенныйЗапрос.КомментарийИсполнителя) КАК КомментарийИсполнителя,
	               |	МАКСИМУМ(ВложенныйЗапрос.ЗадачаУправляющемуСсылка) КАК ЗадачаУправляющемуСсылка,
	               |	МАКСИМУМ(ВложенныйЗапрос.Описание) КАК Описание,
	               |	ВложенныйЗапрос.Ссылка.ПризнакОтветственныеДепартаменты КАК ПризнакОтветственныеДепартаменты,
	               |	СУММА(ВложенныйЗапрос.КвоСлужба) КАК КвоСлужба
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		КритерииПроверкиМагазиновООК.Ссылка КАК Ссылка,
	               |		КритерииПроверкиМагазиновООК.Родитель КАК Родитель,
	               |		КритерииПроверкиМагазиновООК.ЭтоГруппа КАК ЭтоГруппа,
	               |		КритерииПроверкиМагазиновООК.ПолнНаименование КАК ПолнНаименование,
	               |		КритерииПроверкиМагазиновООК.Описание КАК Описание,
	               |		ВЫБОР
	               |			КОГДА НЕ КритерииПроверкиМагазиновООК.ЭтоГруппа
	               |				ТОГДА КритерииПроверкиМагазиновООК.НомерПоПорядку
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА КритерииПроверкиМагазиновООК.Родитель.Ссылка ЕСТЬ NULL 
	               |						ТОГДА 1000 * КритерииПроверкиМагазиновООК.НомерПоПорядку
	               |					ИНАЧЕ 1000 * КритерииПроверкиМагазиновООК.Родитель.НомерПоПорядку + КритерииПроверкиМагазиновООК.НомерПоПорядку
	               |				КОНЕЦ
	               |		КОНЕЦ КАК НомерПоПорядку,
	               |		ВЫБОР
	               |			КОГДА КритерииПроверкиМагазиновООК.Родитель.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ КритерииПроверкиМагазиновООК.Родитель.НомерПоПорядку
	               |		КОНЕЦ КАК РодительНомерПоПорядку,
	               |		0 КАК Кво,
	               |		"""" КАК КомментарииПроверяющего,
	               |		&ПустДата КАК СрокУстранения,
	               |		ЛОЖЬ КАК ОтметкаОбИсполнении,
	               |		"""" КАК КомментарийИсполнителя,
	               |		0 КАК ЗадачаУправляющемуСсылка,
	               |		0 КАК КвоСлужба
	               |	ИЗ
	               |		Справочник.КритерииПроверкиМагазиновООК КАК КритерииПроверкиМагазиновООК
	               |	ГДЕ
	               |		НЕ КритерииПроверкиМагазиновООК.ПометкаУдаления
	               |	
	               |	ОБЪЕДИНИТЬ
	               |	
	               |	ВЫБРАТЬ
	               |		РезультатыПроверкиМагазинаОперДепРезультаты.Критерий,
	               |		РезультатыПроверкиМагазинаОперДепРезультаты.Критерий.Родитель,
	               |		РезультатыПроверкиМагазинаОперДепРезультаты.Критерий.ЭтоГруппа,
	               |		РезультатыПроверкиМагазинаОперДепРезультаты.Критерий.ПолнНаименование,
	               |		"""",
	               |		РезультатыПроверкиМагазинаОперДепРезультаты.Критерий.НомерПоПорядку,
	               |		ВЫБОР
	               |			КОГДА РезультатыПроверкиМагазинаОперДепРезультаты.Критерий.Родитель.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ РезультатыПроверкиМагазинаОперДепРезультаты.Критерий.Родитель.НомерПоПорядку
	               |		КОНЕЦ,
	               |		РезультатыПроверкиМагазинаОперДепРезультаты.Кво,
	               |		РезультатыПроверкиМагазинаОперДепРезультаты.КомментарииПроверяющего,
	               |		РезультатыПроверкиМагазинаОперДепРезультаты.СрокУстранения,
	               |		РезультатыПроверкиМагазинаОперДепРезультаты.ОтметкаОбИсполнении,
	               |		РезультатыПроверкиМагазинаОперДепРезультаты.КомментарийИсполнителя,
	               |		ВЫБОР
	               |			КОГДА РезультатыПроверкиМагазинаОперДепРезультаты.ЗадачаУправляющему ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ РезультатыПроверкиМагазинаОперДепРезультаты.ЗадачаУправляющему
	               |		КОНЕЦ,
	               |		РезультатыПроверкиМагазинаОперДепРезультаты.КвоСлужба
	               |	ИЗ
	               |		Документ.РезультатыПроверкиМагазинаОперДеп.Результаты КАК РезультатыПроверкиМагазинаОперДепРезультаты
	               |	ГДЕ
	               |		РезультатыПроверкиМагазинаОперДепРезультаты.Ссылка = &ВыбДокумент) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Ссылка,
	               |	ВложенныйЗапрос.Родитель,
	               |	ВложенныйЗапрос.ЭтоГруппа,
	               |	ВложенныйЗапрос.ПолнНаименование,
	               |	ВложенныйЗапрос.НомерПоПорядку,
	               |	ВложенныйЗапрос.РодительНомерПоПорядку,
	               |	ВложенныйЗапрос.Ссылка.ПризнакОтветственныеДепартаменты
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОбщийНомерПоПорядку";
				   
				   
	Запрос.УстановитьПараметр("ВыбДокумент", ВыбДокумент);
	Запрос.УстановитьПараметр("ПустДата", Дата(2010,1,1));

	
	тз = Запрос.Выполнить().Выгрузить();
	//тз.Сортировать("РодительРодительНомерПоПорядку, РодительНомерПоПорядку, НомерПоПорядку");
	

	КолвоКритериевОтвДеп = 0;
	КолвоКритериевМаг = 0;

	Нпп = 0;
	Для Каждого стр из тз цикл
		Если стр.ЭтоГруппа тогда
			//Если ЗначениеЗаполнено(стр.Родитель) тогда  // подгруппа
				Обл = Макет1.ПолучитьОбласть("Группа");
				Обл.Параметры.СтрГруппа = стр.ПолнНаименование;
				Обл.Параметры.Родитель = стр.Родитель;
				Обл.Параметры.ТекКритерий = стр.Ссылка;

				Обл.Параметры.БалГруппа = 0;
				Обл.Параметры.БалГруппаСлужба = 0;

				ТабДок.Вывести(Обл);

			//иначе  // раздел
			//Обл = Макет1.ПолучитьОбласть("Раздел");
			//Обл.Параметры.СтрРаздел = стр.ПолнНаименование;
			//Обл.Параметры.Родитель = "Сам";
			//Обл.Параметры.БалРаздел = 0;
			//ТабДок.Вывести(Обл);

			//КонецЕсли;
			
		иначе // строка
			
			Нпп = Нпп + 1;
			Обл = Макет1.ПолучитьОбласть("Строка");
			Обл.Параметры.Нпп = Нпп;
			Обл.Параметры.СтрНаим = стр.ПолнНаименование;
			//Обл.Параметры.СтрОписание = стр.Описание;

			Обл.Параметры.ТекКритерий = стр.Ссылка;
			Обл.Параметры.СтрБал = Число(Булево(стр.Кво));
			Обл.Параметры.СтрБалСлужба = Число(Булево(стр.КвоСлужба));
			Обл.Параметры.СтрКоммент = стр.КомментарииПроверяющего;	
			Обл.Параметры.Родитель = стр.Родитель;

			Если стр.СрокУстранения <> Дата(2010,1,1) тогда
				Обл.Параметры.СтрДат = стр.СрокУстранения;
			КонецЕсли;
			ТабДок.Вывести(Обл);
			ТабДок.Область("R"+ТабДок.ВысотаТаблицы+"C3").Формат = "ЧН=0";
			ТабДок.Область("R"+ТабДок.ВысотаТаблицы+"C4").Формат = "ЧН=0";
			
			//Если стр.ПризнакОтветственныеДепартаменты тогда
			//	КолвоКритериевОтвДеп = КолвоКритериевОтвДеп + 1;
			//иначе
				КолвоКритериевМаг = КолвоКритериевМаг + 1;
			//КонецЕсли;

		КонецЕсли;
	КонецЦикла;
	ТабДок.ФиксацияСверху = 12;
	ОблПусто = Макет1.ПолучитьОбласть("Пусто");
	ТабДок.Вывести(ОблПусто);
    ПроверкаПравРедактирования();
	//КолвоКритериевМаг = Нпп;
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбДокПроверкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗначениеОтбора = Новый Структура("Автор", ПользователиКлиентСервер.ТекущийПользователь());
	ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("Документ.РезультатыПроверкиМагазинаОперДеп.ФормаВыбора",ПараметрыВыбора,,,,, Новый ОписаниеОповещения("ВыбДокПроверкиНачалоВыбораЗавершение", ЭтотОбъект));	
КонецПроцедуры

&НаКлиенте
Процедура ВыбДокПроверкиНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
	    Объект.ВыбДокПроверки = Результат;
		ВыбДокПроверкиПриИзмененииНаСервере();
		ПересчетСуммРазделов();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблДокПриИзменении(Элемент)
	ПоместитьВХранилище(Элемент.ТекущаяОбласть.Низ);
	Если Элемент.ТекущаяОбласть.Лево = 3 Тогда
		Элемент.ТекущаяОбласть.Значение = Число(Булево(Элемент.ТекущаяОбласть.Значение));
		Элемент.ТекущаяОбласть.Формат = "ЧН=0";
		ПересчетСуммРазделовДляЯчейки(Элемент.ТекущаяОбласть.Верх,МеняемоеЗначение,Элемент.ТекущаяОбласть.Значение);
	КонецЕсли;
	
	Если Элемент.ТекущаяОбласть.Лево = 4 Тогда
		Элемент.ТекущаяОбласть.Значение = Число(Булево(Элемент.ТекущаяОбласть.Значение));
		Элемент.ТекущаяОбласть.Формат = "ЧН=0";
		ПересчетСуммРазделовДляЯчейкиСлужба(Элемент.ТекущаяОбласть.Верх,МеняемоеЗначениеСлужба,Элемент.ТекущаяОбласть.Значение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблДокВыбор(Элемент, Область, СтандартнаяОбработка)
	Если Элемент.ТекущаяОбласть.Лево = 3 Тогда
		МеняемоеЗначение = Элемент.ТекущаяОбласть.Значение;
	КонецЕсли;
	Если Элемент.ТекущаяОбласть.Лево = 4 Тогда
		МеняемоеЗначениеСлужба = Элемент.ТекущаяОбласть.Значение;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьШапкуПриИзменении(Элемент)
	Элементы.ВыбДокПроверки.Видимость = ПоказатьШапку;
	Элементы.ШапкаДокумента.Видимость = ПоказатьШапку;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если НЕ Закрывать Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект),"Все несохраненные данные будут удалены, сохранить документ?",РежимДиалогаВопрос.ДаНет,,,"ВНИМАНИЕ");
		Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если СохранитьНаКлиенте() Тогда
			Закрывать = Истина;
			ЭтаФорма.Закрыть();
		КонецЕсли;
	Иначе
		Закрывать = Истина;
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Закрывать = Ложь;
	Если ЕстьДанныеВХранилище Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект), "Есть данные заполненные раннее. Восстановить их?   В случае отказа данные будут удалены",РежимДиалогаВопрос.ДаНет,,,"Внимание!!!");
	КонецЕсли;
	//ТаблДокПриИзменении(Элементы.ТаблДок);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВосстановитьИзХранилища();
		ПересчетСуммРазделов();
	Иначе
		ОчиститьХранилище();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГородПриИзменении(Элемент)
	ГородПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГородПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Город) Тогда
		ХранилищеНастроекДанныхФорм.Сохранить("ООК","Город",Объект.Город);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УправляющийПриИзменении(Элемент)
	УправляющийПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УправляющийПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Управляющий) Тогда
		ХранилищеНастроекДанныхФорм.Сохранить("ООК","Управляющий",Объект.Управляющий);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ПодразделениеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ХранилищеНастроекДанныхФорм.Сохранить("ООК","Подразделение",Объект.Подразделение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РДПриИзменении(Элемент)
	РДПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РДПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.РД) Тогда
		ХранилищеНастроекДанныхФорм.Сохранить("ООК","РД",Объект.РД);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НДПриИзменении(Элемент)
	НДПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НДПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.НД) Тогда
		ХранилищеНастроекДанныхФорм.Сохранить("ООК","НД",Объект.НД);
	КонецЕсли;
КонецПроцедуры
